app/controllers/emails_controller.rb

  def index
    @emails = Email.all
---
SELECT * FROM "emails"

  def show
    @email = Email.find(params[:id])
---
SELECT * FROM "emails" WHERE ("emails"."id" = 1)

  def create
    @email = Email.new(params[:email])
    Email.ruote_create_email(params[:email][:address])

    respond_to do |format|
      if @email.save
---
INSERT INTO "emails" ("address", "created_at", "updated_at", "state") VALUES('test@test.com', '2010-05-06 09:55:49', '2010-05-06 09:55:49', 'pending')

  def destroy
    @email = Email.find(params[:id])
    @email.destroy
---
SELECT * FROM "emails" WHERE ("emails"."id" = 5)
DELETE FROM "emails" WHERE "id" = 5